Tekla.Structures.Model.HierarchicDefinitionTypeEnum
Defines the different types of classification hierarchies.

Tekla.Structures.Model.HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_CUSTOM_TYPE
The custom type classification hierarchy.

Tekla.Structures.Model.HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_LOGICAL_BUILDING_AREA
The logical building area classification hierarchy.

Tekla.Structures.Model.HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_OBJECT_TYPE
The object type classification hierarchy.

Tekla.Structures.Model.HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_WORK_TYPE
The task work type classification hierarchy.

Tekla.Structures.Model.HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO
The task scenario classification hierarchy.